app/controllers/session_controller.rb

  def create
    # if params[:user][:password].blank?
    #   PasswordResetter.new(flash).handle_reset_request(user_params)
    # else
    #   return if log_user_in( UserAuthenticator.new(session,flash).authenticate_user(user_params) )
    # end
    # render :new
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "fish", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"